github/MQA_FastPath/A&B/bench_A_FP_ON_MQA_ON_k8.log
INFO 03-11 18:38:33 [importing.py:17] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 03-11 18:38:33 [importing.py:29] Triton is not installed. Using dummy decorators. Install it via `pip install triton` to enable kernel compilation.
INFO 03-11 18:38:34 [__init__.py:39] Available plugins for group vllm.platform_plugins:
INFO 03-11 18:38:34 [__init__.py:41] - ascend -> vllm_ascend:register
INFO 03-11 18:38:34 [__init__.py:44] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 03-11 18:38:34 [__init__.py:235] Platform plugin ascend is activated
WARNING 03-11 18:38:37 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('/root/miniconda3/envs/lxc/lib/python3.10/site-packages/vllm/_C.abi3.so: undefined symbol: _ZN3c108ListType3getERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEENS_4Type24SingletonOrSharedTypePtrIS9_EE')
WARNING 03-11 18:38:43 [registry.py:401] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_mtp:CustomDeepSeekMTP.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture Qwen2ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2:CustomQwen2ForCausalLM.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_vl:AscendQwen2VLForConditionalGeneration.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_5_vl:AscendQwen2_5_VLForConditionalGeneration.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture DeepseekV2ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV2ForCausalLM.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV3ForCausalLM.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen3_moe:CustomQwen3MoeForCausalLM.
WARNING 03-11 18:38:43 [registry.py:401] Model architecture Qwen3ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen3:CustomQwen3ForCausalLM.
INFO 03-11 18:38:44 [config.py:1980] Disabled the custom all-reduce kernel because it is not supported on current platform.
INFO 03-11 18:38:46 [config.py:1980] Disabled the custom all-reduce kernel because it is not supported on current platform.
INFO 03-11 18:38:48 [config.py:1980] Disabled the custom all-reduce kernel because it is not supported on current platform.
INFO 03-11 18:38:49 [config.py:1980] Disabled the custom all-reduce kernel because it is not supported on current platform.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffc1fbdb640>, endpoint_type='vllm', label=None, base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path='/mnt/ky2307909/siyuan.tong/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=None, model='qwen3-8B', tokenizer='/mnt/ky2307909/siyuan.tong/Qwen3-8B', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=16.0, burstiness=1.0, seed=0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [01:22<00:00,  2.43it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  82.30     
Total input tokens:                      43560     
Total generated tokens:                  44685     
Request throughput (req/s):              2.43      
Output token throughput (tok/s):         542.98    
Total Token throughput (tok/s):          1072.29   
---------------Time to First Token----------------
Mean TTFT (ms):                          260.16    
Median TTFT (ms):                        236.47    
P99 TTFT (ms):                           664.14    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          302.78    
Median TPOT (ms):                        178.11    
P99 TPOT (ms):                           1058.00   
---------------Inter-token Latency----------------
Mean ITL (ms):                           343.23    
Median ITL (ms):                         269.92    
P99 ITL (ms):                            2224.19   
==================================================